app/views/chefs/show.html.erb

SELECT COUNT(*) FROM "recipes" WHERE "recipes"."chef_id" = ?  [["chef_id", 10]]
---
</div>
<% if @chef.recipes.count != 0 %>