app/views/recipes/_form.html.erb

                    <div class="col-md-8 offset-md-2">
                        <%= f.collection_check_boxes :ingredient_ids, Ingredient.all, :id, :name do |cb| %>
---
SELECT "ingredients".* FROM "ingredients"