app/views/recipes/_recipe.html.erb

SELECT "ingredients".* FROM "ingredients" INNER JOIN "recipe_ingredients" ON "ingredients"."id" = "recipe_ingredients"."ingredient_id" WHERE "recipe_ingredients"."recipe_id" = ?  [["recipe_id", 9]]
SELECT 1 AS one FROM "ingredients" INNER JOIN "recipe_ingredients" ON "ingredients"."id" = "recipe_ingredients"."ingredient_id" WHERE "recipe_ingredients"."recipe_id" = ? LIMIT ?  [["recipe_id", 9], ["LIMIT", 1]]
---
            <p><%= truncate(recipe.description, length: 150) %></p>
            <% if recipe.ingredients.any? %>

SELECT "chefs".* FROM "chefs" WHERE "chefs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."recipe_id" = ?  [["recipe_id", 10]]
---
                <span class="quiet">
                    <small>Created <%= time_ago_in_words(recipe.created_at) %> ago by <%= recipe.chef.chefname.capitalize %> | <%= pluralize(recipe.comments.count, "Comment") %></small>