app/views/ingredients/index.html.erb

SELECT COUNT(*) FROM "recipes" INNER JOIN "recipe_ingredients" ON "recipes"."id" = "recipe_ingredients"."recipe_id" WHERE "recipe_ingredients"."ingredient_id" = ?  [["ingredient_id", 1]]
---
                    <li class="chef-title"><%= link_to ing.name.capitalize, ingredient_path(ing) %></li>
                    <li><small><%= pluralize(ing.recipes.count, "recipe") if ing.recipes %></small></li>