app/controllers/chefs_controller.rb

    def index
        @chefs = Chef.paginate(page: params[:page], per_page: 5)
---
SELECT "chefs".* FROM "chefs" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "chefs"

    def create
        @chef = Chef.new(chef_params)
        if @chef.save
---
INSERT INTO "chefs" ("chefname", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)  [["chefname", "Fred"], ["email", "fred@example.com"], ["created_at", "2024-01-19 10:52:30.193053"], ["updated_at", "2024-01-19 10:52:30.193053"], ["password_digest", "[FILTERED]"]]

    def show
        # @chef = Chef.find(params[:id])
        @chef_recipes = @chef.recipes.paginate(page: params[:page], per_page: 5)
---
SELECT COUNT(*) FROM "recipes" WHERE "recipes"."chef_id" = ?  [["chef_id", 1]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."chef_id" = ? ORDER BY "recipes"."updated_at" DESC  [["chef_id", 2]]

    def update
        # @chef = Chef.find(params[:id])

        if @chef.update(chef_params)
---
UPDATE "chefs" SET "email" = ?, "updated_at" = ? WHERE "chefs"."id" = ?  [["email", "touseef.ali@gmail.com"], ["updated_at", "2024-01-19 12:18:33.925075"], ["id", 2]]

    def destroy
        if !@chef.admin?
            # @chef = Chef.find(params[:id])
            @chef.destroy
---
DELETE FROM "chefs" WHERE "chefs"."id" = ?  [["id", 2]]

        def set_chef
            @chef = Chef.find(params[:id])
---
SELECT "chefs".* FROM "chefs" WHERE "chefs"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]