app/controllers/chefs_controller.rb

SELECT "chefs".* FROM "chefs" WHERE "chefs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def show
        @chef = Chef.find(params[:id])

SELECT "chefs".* FROM "chefs" WHERE "chefs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def edit
        @chef = Chef.find(params[:id])

SELECT "chefs".* FROM "chefs" WHERE "chefs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def update
        @chef = Chef.find(params[:id])