app/controllers/comments_controller.rb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? ORDER BY "recipes"."updated_at" DESC LIMIT ?  [["id", 10], ["LIMIT", 1]]
INSERT INTO "comments" ("description", "chef_id", "recipe_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["description", "Trying comment"], ["chef_id", 8], ["recipe_id", 10], ["created_at", "2024-01-22 12:15:40.667427"], ["updated_at", "2024-01-22 12:15:40.667427"]]
---
    def create
        @recipe = Recipe.find(params[:recipe_id])
        @comment = @recipe.comments.build(comment_params)
        @comment.chef = current_chef
        if @comment.save