app/controllers/ingredients_controller.rb

SELECT "recipes".* FROM "recipes" INNER JOIN "recipe_ingredients" ON "recipes"."id" = "recipe_ingredients"."recipe_id" WHERE "recipe_ingredients"."ingredient_id" = ? ORDER BY "recipes"."updated_at" DESC LIMIT ? OFFSET ?  [["ingredient_id", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "recipes" INNER JOIN "recipe_ingredients" ON "recipes"."id" = "recipe_ingredients"."recipe_id" WHERE "recipe_ingredients"."ingredient_id" = ?  [["ingredient_id", 1]]
---
    def show
        @ingredient_recipes = @ingredient.recipes.paginate(page: params[:page], per_page: 5)

SELECT "ingredients".* FROM "ingredients" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "ingredients"
---
    def index
        @ingredients = Ingredient.paginate(page: params[:page], per_page: 5)

INSERT INTO "ingredients" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Beans"], ["created_at", "2024-01-22 11:11:46.470570"], ["updated_at", "2024-01-22 11:11:46.470570"]]
---
    def create
        @ingredient = Ingredient.new(ingredient_params)
        if @ingredient.save

UPDATE "ingredients" SET "name" = ?, "updated_at" = ? WHERE "ingredients"."id" = ?  [["name", "Chicken Pateesa"], ["updated_at", "2024-01-22 11:22:55.108808"], ["id", 1]]
---
    def update
        if @ingredient.update(ingredient_params)

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        def set_ing
            @ingredient = Ingredient.find(params[:id])