app/controllers/recipes_controller.rb

    def index
        @recipes = Recipe.paginate(page: params[:page], per_page: 5)
---
SELECT "recipes".* FROM "recipes" ORDER BY "recipes"."updated_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "recipes"

    def show
        @comment = Comment.new
        @comments = @recipe.comments.paginate(page: params[:page], per_page: 5)
---
SELECT "comments".* FROM "comments" WHERE "comments"."recipe_id" = ? ORDER BY "comments"."updated_at" DESC LIMIT ? OFFSET ?  [["recipe_id", 6], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."recipe_id" = ?  [["recipe_id", 6]]

    def create
        @recipe = Recipe.new(recipe_params)
        @recipe.chef = current_chef
        if @recipe.save
---
INSERT INTO "recipes" ("name", "description", "created_at", "updated_at", "chef_id") VALUES (?, ?, ?, ?, ?)  [["name", "This is a test for ingredients"], ["description", "I love this recipes"], ["created_at", "2024-01-22 11:35:26.204665"], ["updated_at", "2024-01-22 11:35:26.204665"], ["chef_id", 1]]

    def update
        # @recipe = Recipe.find(params[:id])
        if @recipe.update(recipe_params)
---
UPDATE "recipes" SET "description" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["description", "This another recipe is created by fred id - edited by admin"], ["updated_at", "2024-01-22 08:30:36.624525"], ["id", 9]]

    def destroy
        @recipe = Recipe.find(params[:id])
        @recipe.destroy
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? ORDER BY "recipes"."updated_at" DESC LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "recipes" WHERE "recipes"."id" = ?  [["id", 5]]

        def set_recipe
            @recipe = Recipe.find(params[:id])
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? ORDER BY "recipes"."updated_at" DESC LIMIT ?  [["id", 10], ["LIMIT", 1]]