app/controllers/recipes_controller.rb

    def create
        @recipe = Recipe.new(recipe_params)
        @recipe.chef = Chef.first
---
SELECT "chefs".* FROM "chefs" ORDER BY "chefs"."id" ASC LIMIT ?  [["LIMIT", 1]]