app/controllers/sessions_controller.rb

    def create
        chef = Chef.find_by(email: params[:session][:email].downcase)
---
SELECT "chefs".* FROM "chefs" WHERE "chefs"."email" = ? LIMIT ?  [["email", "fred@example.com"], ["LIMIT", 1]]